//chef_bintreeq_2.cpp

//==================================================================================
//Бинарный поиск последнего значения, для которого функция check вернет true
//==================================================================================

typedef bool (*checkValue)(int v);

int binarySearchLastTrue(int b, int e, checkValue check)
{
    int lastTrue = -1;

    while(true)
    {
        int v = b + (e - b) / 2;

        if(check(v))
        {
            lastTrue = v;
            b = v+1;                    
        }
        else
        {
            e = v-1;
        }

        if(b > e)
        {
            return lastTrue;
        }
    }
}

//==================================================================================
//==================================================================================
