//==========================================================================
//Система непересекающихся множеств
//Disjoint-set data structure
//==========================================================================

const int djItemCount = 1000010;
int p[djItemCount];

void djInit()
{
    iota(p, p+djItemCount, 0);    
}

int djFind(int x) 
{
    if(p[x]==x)
    {
        return x;
    }
    else
    {
        p[x] = djFind(p[x]);
        return p[x];
    }
}

void djUnite(int x, int y) 
{
    int fx = djFind(x);
    int fy = djFind(y);
    
    if(fx == fy)
    {
        return;
    }

    p[fx] = fy;    
}

//==========================================================================
//==========================================================================
//==========================================================================
